lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  ISP Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_ISP_OUT_H_SIZE_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_SIZE:12;     /**< \brief [11:0] Horizontal picture size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_H_SIZE_Bits;

/** \brief  ISP Output Horizontal Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_H_SIZE_SHD:13; /**< \brief [12:0] Current horizontal picture size (r) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits;

/** \brief  ISP Output Window Vertical Offset Register */
typedef struct _Ifx_CIF_ISP_OUT_V_OFFS_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_OFFS:12;     /**< \brief [11:0] Vertical Picture Offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_V_OFFS_Bits;

/** \brief  ISP Output Window Vertical Offset Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_OFFS_SHD:12; /**< \brief [11:0] Current vertical picture offset (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits;

/** \brief  ISP Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_ISP_OUT_V_SIZE_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_SIZE:12;     /**< \brief [11:0] Vertical picture size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_V_SIZE_Bits;

/** \brief  ISP Output Vertical Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_SIZE_SHD:12; /**< \brief [11:0] Current vertical pic size (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits;

/** \brief  ISP Raw Interrupt Status Register */
typedef struct _Ifx_CIF_ISP_RIS_Bits
{
    Ifx_Strict_32Bit RIS_ISP_OFF:1;         /**< \brief [0:0] Isp was Turned Off (vsynced) (r) */
    Ifx_Strict_32Bit RIS_FRAME:1;           /**< \brief [1:1] Frame was Completely Put Out (r) */
    Ifx_Strict_32Bit RIS_DATA_LOSS:1;       /**< \brief [2:2] Loss of Data (r) */
    Ifx_Strict_32Bit RIS_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred (r) */
    Ifx_Strict_32Bit reserved_4:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RIS_FRAME_IN:1;        /**< \brief [5:5] Sampled Input Frame is Complete (r) */
    Ifx_Strict_32Bit RIS_V_START:1;         /**< \brief [6:6] Start Edge of v_sync (r) */
    Ifx_Strict_32Bit RIS_H_START:1;         /**< \brief [7:7] Start Edge of h_sync (r) */
    Ifx_Strict_32Bit reserved_8:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RIS_WD_TRIG:1;         /**< \brief [19:19] A watchdog timeout was triggered at the ISP input (r) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_RIS_Bits;

/** \brief  ISP Image Stabilization Control Register */
typedef struct _Ifx_CIF_ISPIS_CTRL_Bits
{
    Ifx_Strict_32Bit IS_EN:1;               /**< \brief [0:0] Image Stabilization Enable (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_CTRL_Bits;

/** \brief  ISP Image Stabilization Camera Displacement Register */
typedef struct _Ifx_CIF_ISPIS_DISPLACE_Bits
{
    Ifx_Strict_32Bit DX:12;                 /**< \brief [11:0] Camera Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DY:12;                 /**< \brief [27:16] Camera Displacement (rw) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_DISPLACE_Bits;

/** \brief  ISP Image Stabilization Horizontal Offset Of Output Window Register */
typedef struct _Ifx_CIF_ISPIS_H_OFFS_Bits
{
    Ifx_Strict_32Bit IS_H_OFFS:12;          /**< \brief [11:0] Horizontal Picture Offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_H_OFFS_Bits;

/** \brief  SP Image Current Horizontal Offset Of Output Window Shadow Register */
typedef struct _Ifx_CIF_ISPIS_H_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit IS_H_OFFS_SHD:13;      /**< \brief [12:0] Horizontal Picture Offset (r) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_H_OFFS_SHD_Bits;

/** \brief  ISP Image Stabilization Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_ISPIS_H_SIZE_Bits
{
    Ifx_Strict_32Bit IS_H_SIZE:12;          /**< \brief [11:0] Horizontal Picture Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_H_SIZE_Bits;

/** \brief  ISP Image Current Output Horizontal Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISPIS_H_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_H_SIZE_SHD:13;     /**< \brief [12:0] Horizontal Picture Size (r) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_H_SIZE_SHD_Bits;

/** \brief  ISP Image Stabilization Maximum Horizontal Displacement Register */
typedef struct _Ifx_CIF_ISPIS_MAX_DX_Bits
{
    Ifx_Strict_32Bit IS_MAX_DX:12;          /**< \brief [11:0] Maximum Horizontal Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_MAX_DX_Bits;

/** \brief  ISP Image Stabilization Maximum Vertical Displacement Register */
typedef struct _Ifx_CIF_ISPIS_MAX_DY_Bits
{
    Ifx_Strict_32Bit IS_MAX_DY:12;          /**< \brief [11:0] Maximum Vertical Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_MAX_DY_Bits;

/** \brief  ISP Image Stabilization Recenter Register */
typedef struct _Ifx_CIF_ISPIS_RECENTER_Bits
{
    Ifx_Strict_32Bit RECENTER:3;            /**< \brief [2:0] Recenter (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_RECENTER_Bits;

/** \brief  ISP Image Stabilization Vertical Offset Of Output Window Register */
typedef struct _Ifx_CIF_ISPIS_V_OFFS_Bits
{
    Ifx_Strict_32Bit IS_V_OFFS:12;          /**< \brief [11:0] Vertical Picture Offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_V_OFFS_Bits;

/** \brief  ISP Image Current Vertical Offset Of Output Window Shadow Register */
typedef struct _Ifx_CIF_ISPIS_V_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit IS_V_OFFS_SHD:12;      /**< \brief [11:0] Vertical Picture Offset (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_V_OFFS_SHD_Bits;

/** \brief  ISP Image Stabilization Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_ISPIS_V_SIZE_Bits
{
    Ifx_Strict_32Bit IS_V_SIZE:12;          /**< \brief [11:0] Vertical Picture Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_V_SIZE_Bits;

/** \brief  ISP Image Current Output Vertical Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISPIS_V_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_V_SIZE_SHD:12;     /**< \brief [11:0] Vertical Picture Size (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISPIS_V_SIZE_SHD_Bits;

