lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  JPE Huffman Table Selector For AC Values Register */
typedef struct _Ifx_CIF_JPE_AC_TABLE_SELECT_Bits
{
    Ifx_Strict_32Bit AC_TABLE_SELECT:3;     /**< \brief [2:0] AC Table Selector (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_AC_TABLE_SELECT_Bits;

/** \brief  JPE Cb/Cr Value Scaling Control Register */
typedef struct _Ifx_CIF_JPE_CBCR_SCALE_EN_Bits
{
    Ifx_Strict_32Bit CBCR_SCALE_EN:1;       /**< \brief [0:0] Cb/Cr scale flag (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_CBCR_SCALE_EN_Bits;

/** \brief  JPE Huffman Table Selector For DC Values Register */
typedef struct _Ifx_CIF_JPE_DC_TABLE_SELECT_Bits
{
    Ifx_Strict_32Bit DC_TABLE_SELECT:3;     /**< \brief [2:0] DC Table Selector (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_DC_TABLE_SELECT_Bits;

/** \brief  JPE Debug Information Register */
typedef struct _Ifx_CIF_JPE_DEBUG_Bits
{
    Ifx_Strict_32Bit reserved_0:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DEB_QIQ_TABLE_ACC:1;   /**< \brief [2:2] QIQ Table Access (r) */
    Ifx_Strict_32Bit DEB_VLC_ENCODE_BUSY:1; /**< \brief [3:3] VLC Encode Busy (r) */
    Ifx_Strict_32Bit DEB_R2B_MEMORY_FULL:1; /**< \brief [4:4] R2B Memory Full (r) */
    Ifx_Strict_32Bit DEB_VLC_TABLE_BUSY:1;  /**< \brief [5:5] Debug VLC Table Busy (r) */
    Ifx_Strict_32Bit reserved_6:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DEB_BAD_TABLE_ACCESS:1;    /**< \brief [8:8] Debug Bad Table Access (r) */
    Ifx_Strict_32Bit reserved_9:23;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_DEBUG_Bits;

/** \brief  JPEG Codec Horizontal Image Size For Encoding Register */
typedef struct _Ifx_CIF_JPE_ENC_HSIZE_Bits
{
    Ifx_Strict_32Bit ENC_HSIZE:12;          /**< \brief [11:0] Horizontal Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ENC_HSIZE_Bits;

/** \brief  JPEG Codec Vertical Image Size For Encoding Register */
typedef struct _Ifx_CIF_JPE_ENC_VSIZE_Bits
{
    Ifx_Strict_32Bit ENC_VSIZE:12;          /**< \brief [11:0] Vertical Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ENC_VSIZE_Bits;

/** \brief  JPE Start Command To Start JFIF Stream Encoding Register */
typedef struct _Ifx_CIF_JPE_ENCODE_Bits
{
    Ifx_Strict_32Bit ENCODE:1;              /**< \brief [0:0] Encode (w) */
    Ifx_Strict_32Bit reserved_1:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CONT_MODE:2;           /**< \brief [5:4] Encoder continuous mode (rw) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ENCODE_Bits;

/** \brief  JPE Encode Mode Register */
typedef struct _Ifx_CIF_JPE_ENCODE_MODE_Bits
{
    Ifx_Strict_32Bit ENCODE_MODE:1;         /**< \brief [0:0] Encode Mode (r) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ENCODE_MODE_Bits;

/** \brief  JPE Encoder Status Flag Register */
typedef struct _Ifx_CIF_JPE_ENCODER_BUSY_Bits
{
    Ifx_Strict_32Bit CODEC_BUSY:1;          /**< \brief [0:0] Codec Busy (r) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ENCODER_BUSY_Bits;

/** \brief  JPE Error Interrupt Clear Register */
typedef struct _Ifx_CIF_JPE_ERROR_ICR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (w) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (w) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (w) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (w) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_ICR_Bits;

/** \brief  JPE Error Interrupt Mask Register */
typedef struct _Ifx_CIF_JPE_ERROR_IMR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (rw) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (rw) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (rw) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (rw) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_IMR_Bits;

/** \brief  JPE Error Interrupt Set Register */
typedef struct _Ifx_CIF_JPE_ERROR_ISR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (w) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (w) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (w) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (w) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_ISR_Bits;

/** \brief  JPE Error Masked Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_ERROR_MIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (r) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (r) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (r) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_MIS_Bits;

/** \brief  JPE Error Raw Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_ERROR_RIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (r) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (r) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (r) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_RIS_Bits;

