lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  JPE Command To Start Stream Header Generation Register */
typedef struct _Ifx_CIF_JPE_GEN_HEADER_Bits
{
    Ifx_Strict_32Bit GEN_HEADER:1;          /**< \brief [0:0] Generate Header (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_GEN_HEADER_Bits;

/** \brief  JPE Header Mode Definition Register */
typedef struct _Ifx_CIF_JPE_HEADER_MODE_Bits
{
    Ifx_Strict_32Bit HEADER_MODE:2;         /**< \brief [1:0] Header Mode (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_HEADER_MODE_Bits;

/** \brief  JPE Automatic Configuration Update Register */
typedef struct _Ifx_CIF_JPE_INIT_Bits
{
    Ifx_Strict_32Bit JP_INIT:1;             /**< \brief [0:0] JPEG Init (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_INIT_Bits;

/** \brief  JPEG Picture Encoding Format Register */
typedef struct _Ifx_CIF_JPE_PIC_FORMAT_Bits
{
    Ifx_Strict_32Bit ENC_PIC_FORMAT:3;      /**< \brief [2:0] Picture Encoding Format (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_PIC_FORMAT_Bits;

/** \brief  JPE Restart Marker Insertion Register */
typedef struct _Ifx_CIF_JPE_RESTART_INTERVAL_Bits
{
    Ifx_Strict_32Bit RESTART_INTERVAL:16;   /**< \brief [15:0] Restart Interval (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_RESTART_INTERVAL_Bits;

/** \brief  JPEG Status Interrupt Clear Register */
typedef struct _Ifx_CIF_JPE_STATUS_ICR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (w) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (w) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_ICR_Bits;

/** \brief  JPEG Status Interrupt Mask Register */
typedef struct _Ifx_CIF_JPE_STATUS_IMR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (rw) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (rw) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_IMR_Bits;

/** \brief  JPEG Status Interrupt Set Register */
typedef struct _Ifx_CIF_JPE_STATUS_ISR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (w) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (w) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_ISR_Bits;

/** \brief  JPEG Status Masked Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_MIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (r) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_MIS_Bits;

/** \brief  JPEG Status Raw Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_RIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (r) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_RIS_Bits;

/** \brief  JPE Table Programming Register */
typedef struct _Ifx_CIF_JPE_TABLE_DATA_Bits
{
    Ifx_Strict_32Bit TABLE_WDATA_L:8;       /**< \brief [7:0] Table data LSB (w) */
    Ifx_Strict_32Bit TABLE_WDATA_H:8;       /**< \brief [15:8] Table data MSB (w) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_DATA_Bits;

/** \brief  JPE Header Generation Debug Register */
typedef struct _Ifx_CIF_JPE_TABLE_FLUSH_Bits
{
    Ifx_Strict_32Bit TABLE_FLUSH:1;         /**< \brief [0:0] Header generation debug control flag (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_FLUSH_Bits;

/** \brief  JPE Table Programming Select Register */
typedef struct _Ifx_CIF_JPE_TABLE_ID_Bits
{
    Ifx_Strict_32Bit TABLE_ID:4;            /**< \brief [3:0] JPE Table ID (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_ID_Bits;

/** \brief  JPE Huffman AC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TAC0_LEN_Bits
{
    Ifx_Strict_32Bit TAC0_LEN:8;            /**< \brief [7:0] AC Table 0 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TAC0_LEN_Bits;

/** \brief  JPE Huffman AC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TAC1_LEN_Bits
{
    Ifx_Strict_32Bit TAC1_LEN:8;            /**< \brief [7:0] AC Table 1 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TAC1_LEN_Bits;

/** \brief  JPE Huffman DC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TDC0_LEN_Bits
{
    Ifx_Strict_32Bit TDC0_LEN:8;            /**< \brief [7:0] DC Table 0 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TDC0_LEN_Bits;

/** \brief  JPE Huffman DC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TDC1_LEN_Bits
{
    Ifx_Strict_32Bit TDC1_LEN:8;            /**< \brief [7:0] DC Table 1 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TDC1_LEN_Bits;

/** \brief  Q- table Selector 1, Quant. Table For U Component */
typedef struct _Ifx_CIF_JPE_TQ_U_SELECT_Bits
{
    Ifx_Strict_32Bit TQ1_SELECT:2;          /**< \brief [1:0] Q-Table Selector U (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TQ_U_SELECT_Bits;

/** \brief  Q- table Selector 2 Quant Table For V Component */
typedef struct _Ifx_CIF_JPE_TQ_V_SELECT_Bits
{
    Ifx_Strict_32Bit TQ2_SELECT:2;          /**< \brief [1:0] Q-Table Selector V (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TQ_V_SELECT_Bits;

/** \brief  Q- table Selector 0 Quant Table For Y Component */
typedef struct _Ifx_CIF_JPE_TQ_Y_SELECT_Bits
{
    Ifx_Strict_32Bit TQ0_SELECT:2;          /**< \brief [1:0] Q-Table Selector Y (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TQ_Y_SELECT_Bits;

/** \brief  JPE Y Value Scaling Control Register */
typedef struct _Ifx_CIF_JPE_Y_SCALE_EN_Bits
{
    Ifx_Strict_32Bit Y_SCALE_EN:1;          /**< \brief [0:0] Y scale flag (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_Y_SCALE_EN_Bits;

/** \brief  Linear Downscaler Control Register */
typedef struct _Ifx_CIF_LDS_CTRL_Bits
{
    Ifx_Strict_32Bit LDS_V_EN:1;            /**< \brief [0:0] Vertical scaling enable (rw) */
    Ifx_Strict_32Bit LDS_H_EN:1;            /**< \brief [1:1] Horizontal scaling enable (rw) */
    Ifx_Strict_32Bit reserved_2:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LDS_V_MODE:2;          /**< \brief [5:4] Vertical scaling mode (rw) */
    Ifx_Strict_32Bit reserved_6:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LDS_H_MODE:2;          /**< \brief [9:8] Horizontal scaling mode (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_CIF_LDS_CTRL_Bits;

/** \brief  Linear Downscaler Factor Register */
typedef struct _Ifx_CIF_LDS_FAC_Bits
{
    Ifx_Strict_32Bit LDS_V_FAC:8;           /**< \brief [7:0] Vertical scaling factor (rw) */
    Ifx_Strict_32Bit reserved_8:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LDS_H_FAC:8;           /**< \brief [23:16] Horizontal scaling factor (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_LDS_FAC_Bits;

/** \brief  Memory Interface Counter Value of JPEG or RAW Data Bytes Register */
typedef struct _Ifx_CIF_MI_BYTE_CNT_Bits
{
    Ifx_Strict_32Bit BYTE_CNT:24;           /**< \brief [23:0] Byte Count (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_BYTE_CNT_Bits;

/** \brief  Memory Interface Global Control Register */
typedef struct _Ifx_CIF_MI_CTRL_Bits
{
    Ifx_Strict_32Bit MP_ENABLE:1;           /**< \brief [0:0] Enables main picture data path, YCbCr mode (rw) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit JPEG_ENABLE:1;         /**< \brief [2:2] Enables JPEG mode (rw) */
    Ifx_Strict_32Bit RAW_ENABLE:1;          /**< \brief [3:3] Enables RAW mode (rw) */
    Ifx_Strict_32Bit reserved_4:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BYTE_SWAP:1;           /**< \brief [7:7] Byte Swap Enable (rw) */
    Ifx_Strict_32Bit reserved_8:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BURST_LEN_LUM:1;       /**< \brief [16:16] Luminance Burst Length (rw) */
    Ifx_Strict_32Bit reserved_17:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BURST_LEN_CHROM:1;     /**< \brief [18:18] Chrominance Burst Length (rw) */
    Ifx_Strict_32Bit reserved_19:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit INIT_BASE_EN:1;        /**< \brief [20:20] Init Base Address Enable (rw) */
    Ifx_Strict_32Bit INIT_OFFSET_EN:1;      /**< \brief [21:21] Init Offset Counter Enable (rw) */
    Ifx_Strict_32Bit MP_WRITE_FORMAT:2;     /**< \brief [23:22] Main Picture YCbCr Write Format (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_CTRL_Bits;

/** \brief  Memory Interface Global Control Internal Shadow Register */
typedef struct _Ifx_CIF_MI_CTRL_SHD_Bits
{
    Ifx_Strict_32Bit MP_ENABLE_IN:1;        /**< \brief [0:0] Main Picture In Enable (r) */
    Ifx_Strict_32Bit reserved_1:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit JPEG_ENABLE_IN:1;      /**< \brief [4:4] JPEG In Enable (r) */
    Ifx_Strict_32Bit RAW_ENABLE_IN:1;       /**< \brief [5:5] RAW In Enable (r) */
    Ifx_Strict_32Bit reserved_6:10;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MP_ENABLE_OUT:1;       /**< \brief [16:16] Main Picture Out Enable (r) */
    Ifx_Strict_32Bit reserved_17:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit JPEG_ENABLE_OUT:1;     /**< \brief [18:18] JPEG Out Enable (r) */
    Ifx_Strict_32Bit RAW_ENABLE_OUT:1;      /**< \brief [19:19] RAW Out Enable (r) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_CTRL_SHD_Bits;

/** \brief  MI Interrupt Clear Register */
typedef struct _Ifx_CIF_MI_ICR_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;        /**< \brief [0:0] Main Picture Frame End (w) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;           /**< \brief [2:2] Macro Block Line Interrupt (w) */
    Ifx_Strict_32Bit FILL_MPY:1;            /**< \brief [3:3] Fill Main Picture Y (w) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;           /**< \brief [4:4] Wrap Main Picture Y (w) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;          /**< \brief [5:5] Wrap Main Picture Cb (w) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;          /**< \brief [6:6] Wrap Main Picture Cr (w) */
    Ifx_Strict_32Bit reserved_7:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;           /**< \brief [10:10] Bus Error (w) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_ICR_Bits;

/** \brief  MI Interrupt Mask ‘1’ interrupt active ‘0’ interrupt masked */
typedef struct _Ifx_CIF_MI_IMSC_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;        /**< \brief [0:0] Main Picture Frame End (rw) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;           /**< \brief [2:2] Macro Block Line Interrupt (rw) */
    Ifx_Strict_32Bit FILL_MP_Y:1;           /**< \brief [3:3] Fill Main Picture Y (rw) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;           /**< \brief [4:4] Wrap Main Picture Y (rw) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;          /**< \brief [5:5] Wrap Main Picture Cb (rw) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;          /**< \brief [6:6] Wrap Main Picture Cr (rw) */
    Ifx_Strict_32Bit reserved_7:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;           /**< \brief [10:10] Bus Error (rw) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_IMSC_Bits;

/** \brief  Memory Interface Control Register For Address Init And Skip Function
 * Register */
typedef struct _Ifx_CIF_MI_INIT_Bits
{
    Ifx_Strict_32Bit reserved_0:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MI_SKIP:1;             /**< \brief [2:2] Skip Picture (w) */
    Ifx_Strict_32Bit reserved_3:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MI_CFG_UPD:1;          /**< \brief [4:4] Forced Configuration Update (w) */
    Ifx_Strict_32Bit reserved_5:27;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_INIT_Bits;

