lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  MI Interrupt Set Register */
typedef struct _Ifx_CIF_MI_ISR_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;        /**< \brief [0:0] Main Picture Frame End (w) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;           /**< \brief [2:2] Macro Block Line Interrupt (w) */
    Ifx_Strict_32Bit FILL_MP_Y:1;           /**< \brief [3:3] Fill Main Picture Y (w) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;           /**< \brief [4:4] Wrap Main Picture Y (w) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;          /**< \brief [5:5] Wrap Main Picture Cb (w) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;          /**< \brief [6:6] Wrap Main Picture Cr (w) */
    Ifx_Strict_32Bit reserved_7:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit Bus_ERROR:1;           /**< \brief [10:10] Bus Error (w) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_ISR_Bits;

/** \brief  MI Masked Interrupt Status Registe */
typedef struct _Ifx_CIF_MI_MIS_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;        /**< \brief [0:0] Main Picture Frame End (r) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;           /**< \brief [2:2] Macro Block Line Interrupt (r) */
    Ifx_Strict_32Bit FILL_MP_Y:1;           /**< \brief [3:3] Fill Main Picture Y (r) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;           /**< \brief [4:4] Wrap Main Picture Y (r) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;          /**< \brief [5:5] Wrap Main Picture Cb (r) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;          /**< \brief [6:6] Wrap Main Picture Cr (r) */
    Ifx_Strict_32Bit reserved_7:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;           /**< \brief [10:10] Bus Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_MIS_Bits;

/** \brief  Memory Interface Base Address For Main Picture Cb Component Ring
 * Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_BASEAD_INIT:30;  /**< \brief [31:2] Main Picture Cb Base Address Init (rw) */
} Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits;

/** \brief  Memory Interface Base Address Shadow Register For Main Picture Cb
 * Component Ring Register */
typedef struct _Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_BASE_AD:30;      /**< \brief [31:2] Main Picture Cb Base Address (r) */
} Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits;

/** \brief  Memory Interface Offset Counter Init Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT_INIT:22;    /**< \brief [23:2] Main Picture Cb Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits;

/** \brief  Memory Interface Current Offset Counter Of Main Picture Cb Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT:22;     /**< \brief [23:2] Main Picture Cb Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits;

/** \brief  Memory Interface Offset Counter Start Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT_START:22;   /**< \brief [23:2] Main Picture Cb Offset Count Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits;

/** \brief  Memory Interface Size Of Main Picture Cb Component Ring Buffer
 * Register */
typedef struct _Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_SIZE_INIT:22;    /**< \brief [23:2] Main Picture Cb Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits;

/** \brief  Memory Interface Size Shadow Register Of Main Picture Cb Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_SIZE:22;         /**< \brief [23:2] Main Picture Cb Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits;

/** \brief  Memory Interface Base Address For Main Picture Cr Component Ring
 * Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_BASE_AD_INIT:30; /**< \brief [31:2] Main Picture Cr Base Address Init (rw) */
} Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits;

/** \brief  Memory Interface Base Address Shadow Register For Main Picture Cr
 * Component Ring Register */
typedef struct _Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_BASE_AD:30;      /**< \brief [31:2] Main Picture Cr Base Address (r) */
} Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits;

/** \brief  Memory Interface Offset Counter Init value For Main Picture Cr
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT_INIT:22;    /**< \brief [23:2] Main Picture Cr Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits;

/** \brief  Memory Interface Current Offset Counter Of Main Picture Cr Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT:22;     /**< \brief [23:2] Main Picture Cr Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits;

