lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  Memory Interface Offset Counter Start Value For Main Picture Cr
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT_START:22;   /**< \brief [23:2] Main Picture Cr Offset Counter Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits;

/** \brief  Memory Interface Size Of Main Picture Cr Component Ring Buffer
 * Register */
typedef struct _Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_SIZE_INIT:22;    /**< \brief [23:2] Main Picture Cr Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits;

/** \brief  Memory Interface Size Shadow Register Of Main Picture Cr Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_SIZE:22;         /**< \brief [23:2] Main Picture Cr Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits;

/** \brief  Memory Interface Base Address For Main Picture Y Component, JPEG or
 * RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_BASE_AD_INIT:30;  /**< \brief [31:2] Main Picture Y Base Address Init (rw) */
} Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits;

/** \brief  Memory Interface Base Address Shadow Register For Main Picture Y
 * Component, JPEG Register */
typedef struct _Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_BASE_AD:30;       /**< \brief [31:2] Main Picture Y Base Address (r) */
} Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits;

/** \brief  Memory Interface Fill Level Interrupt Offset Value For Main Picture
 * Y, JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_IRQ_OFFS_INIT:22; /**< \brief [23:2] Main Picture Y IRQ Offset Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits;

/** \brief  Memory Interface Shadow Register of Fill Level Interrupt Offset
 * Value For Main Picture Y Register */
typedef struct _Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_IRQ_OFFS:22;      /**< \brief [23:2] Main Picture Y IRQ Offset (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits;

/** \brief  Memory Interface Offset Counter Init Value For Main Picture Y, JPEG
 * or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_OFFS_CNT_INIT:22; /**< \brief [23:2] Main Picture Y Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits;

/** \brief  Memory Interface Current Offset Counter of Main Picture Y Component
 * JPEG or RAW Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_OFFS_CNT:22;      /**< \brief [23:2] Main Picture Y Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits;

/** \brief  Memory Interface Offset Counter Start Value For Main Picture Y, JPEG
 * or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_OFFS_CNT_START:22;    /**< \brief [23:2] Main Picture Y Offset Counter Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits;

/** \brief  Memory Interface Size of main picture Y component, JPEG or RAW data
 * Register */
typedef struct _Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_SIZE_INIT:22;     /**< \brief [23:2] Main Picture Y Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits;

/** \brief  Memory Interface Size Shadow Register of Main Picture Y
 * Component,JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_SIZE:22;          /**< \brief [23:2] Main Picture Y Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits;

/** \brief  MI Raw Interrupt Status Register */
typedef struct _Ifx_CIF_MI_RIS_Bits
{
    Ifx_Strict_32Bit MP_FRAME_END:1;        /**< \brief [0:0] Main Picture Frame End (r) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MBLK_LINE:1;           /**< \brief [2:2] Macro Block Line Interrupt (r) */
    Ifx_Strict_32Bit FILL_MP_Y:1;           /**< \brief [3:3] Fill Main Picture Y (r) */
    Ifx_Strict_32Bit WRAP_MP_Y:1;           /**< \brief [4:4] Wrap Main Picture Y (r) */
    Ifx_Strict_32Bit WRAP_MP_CB:1;          /**< \brief [5:5] Wrap Main Picture Cb (r) */
    Ifx_Strict_32Bit WRAP_MP_CR:1;          /**< \brief [6:6] Wrap Main Picture Cr (r) */
    Ifx_Strict_32Bit reserved_7:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUS_ERROR:1;           /**< \brief [10:10] Bus Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_MI_RIS_Bits;

/** \brief  MI Status Register */
typedef struct _Ifx_CIF_MI_STATUS_Bits
{
    Ifx_Strict_32Bit MP_Y_FIFO_FULL:1;      /**< \brief [0:0] Main Picture Y FIFO Full (r) */
    Ifx_Strict_32Bit MP_CB_FIFO_FULL:1;     /**< \brief [1:1] Main Picture Cb FIFO Full (r) */
    Ifx_Strict_32Bit MP_CR_FIFO_FULL:1;     /**< \brief [2:2] Main Picture Cr FIFO Full (r) */
    Ifx_Strict_32Bit reserved_3:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUS_WRITE_ERROR:1;     /**< \brief [8:8] Bus Write Error (r) */
    Ifx_Strict_32Bit reserved_9:23;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_STATUS_Bits;

