lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  Debug Path Frame/Line Counter Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DP_FLC_STAT_Bits B;             /**< \brief Bitfield access */
} Ifx_CIF_DP_FLC_STAT;

/** \brief  Debug Path Predivider Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DP_PDIV_CTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_DP_PDIV_CTRL;

/** \brief  Debug Path Predivider Counter Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DP_PDIV_STAT_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_DP_PDIV_STAT;

/** \brief  Debug Path Timestamp Counter Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DP_TSC_STAT_Bits B;             /**< \brief Bitfield access */
} Ifx_CIF_DP_TSC_STAT;

/** \brief  Debug Path User Defined Symbol Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DP_UDS_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_DP_UDS;

/** \brief  CIF Data Path Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_DPCL_Bits B;                    /**< \brief Bitfield access */
} Ifx_CIF_DPCL;

/** \brief  Extra Path Image Cropping Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_CTRL_Bits B;              /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_CTRL;

/** \brief  Extra Path Image Cropping Camera Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_DISPLACE_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_DISPLACE;

/** \brief  Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_H_OFFS_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_H_OFFS;

/** \brief  Extra Path Image Current Horizontal Offset Of Output Window Shadow
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_H_OFFS_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_H_OFFS_SHD;

/** \brief  Extra Path Image Cropping Output Horizontal Picture Size Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_H_SIZE_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_H_SIZE;

/** \brief  Extra Path Image Current Output Horizontal Picture Size Shadow
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_H_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_H_SIZE_SHD;

/** \brief  Extra Path Image Cropping Maximum Horizontal Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_MAX_DX_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_MAX_DX;

/** \brief  Extra Path Image Cropping Maximum Vertical Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_MAX_DY_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_MAX_DY;

/** \brief  Extra Path Image Cropping Recenter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_RECENTER_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_RECENTER;

/** \brief  Extra Path Image Cropping Vertical Offset Of Output Window Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_V_OFFS_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_V_OFFS;

/** \brief  Extra Path Image Current Vertical Offset Of Output Window Shadow
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_V_OFFS_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_V_OFFS_SHD;

/** \brief  Extra Path Image Cropping Output Vertical Picture Size Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_V_SIZE_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_V_SIZE;

/** \brief  Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_EP_IC_V_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_V_SIZE_SHD;

/** \brief  CIF Internal Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ICCL_Bits B;                    /**< \brief Bitfield access */
} Ifx_CIF_ICCL;

/** \brief  CIF Revision Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_CIF_ID;

