lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  ISP Output Window Vertical Offset Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_OFFS_SHD;

/** \brief  ISP Output Vertical Picture Size Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_SIZE_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_SIZE;

/** \brief  ISP Output Vertical Picture Size Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_SIZE_SHD;

/** \brief  ISP Raw Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISP_RIS_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_ISP_RIS;

/** \brief  ISP Image Stabilization Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_CTRL_Bits B;              /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_CTRL;

/** \brief  ISP Image Stabilization Camera Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_DISPLACE_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_DISPLACE;

/** \brief  ISP Image Stabilization Horizontal Offset Of Output Window Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_OFFS_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_OFFS;

/** \brief  SP Image Current Horizontal Offset Of Output Window Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_OFFS_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_OFFS_SHD;

/** \brief  ISP Image Stabilization Output Horizontal Picture Size Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_SIZE_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_SIZE;

/** \brief  ISP Image Current Output Horizontal Picture Size Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_SIZE_SHD;

/** \brief  ISP Image Stabilization Maximum Horizontal Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_MAX_DX_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_MAX_DX;

/** \brief  ISP Image Stabilization Maximum Vertical Displacement Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_MAX_DY_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_MAX_DY;

/** \brief  ISP Image Stabilization Recenter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_RECENTER_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_RECENTER;

/** \brief  ISP Image Stabilization Vertical Offset Of Output Window Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_OFFS_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_OFFS;

/** \brief  ISP Image Current Vertical Offset Of Output Window Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_OFFS_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_OFFS_SHD;

/** \brief  ISP Image Stabilization Output Vertical Picture Size Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_SIZE_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_SIZE;

/** \brief  ISP Image Current Output Vertical Picture Size Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_SIZE_SHD;

/** \brief  JPE Huffman Table Selector For AC Values Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_AC_TABLE_SELECT_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_AC_TABLE_SELECT;

/** \brief  JPE Cb/Cr Value Scaling Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_CBCR_SCALE_EN_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_JPE_CBCR_SCALE_EN;

/** \brief  JPE Huffman Table Selector For DC Values Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_DC_TABLE_SELECT_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_DC_TABLE_SELECT;

