lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  JPEG Status Raw Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_RIS_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_RIS;

/** \brief  JPE Table Programming Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_DATA_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_DATA;

/** \brief  JPE Header Generation Debug Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_FLUSH_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_FLUSH;

/** \brief  JPE Table Programming Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_ID_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_ID;

/** \brief  JPE Huffman AC Table 0 Length Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TAC0_LEN_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_JPE_TAC0_LEN;

/** \brief  JPE Huffman AC Table 1 Length Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TAC1_LEN_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_JPE_TAC1_LEN;

/** \brief  JPE Huffman DC Table 0 Length Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TDC0_LEN_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_JPE_TDC0_LEN;

/** \brief  JPE Huffman DC Table 1 Length Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TDC1_LEN_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_JPE_TDC1_LEN;

/** \brief  Q- table Selector 1, Quant. Table For U Component */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_U_SELECT_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_U_SELECT;

/** \brief  Q- table Selector 2 Quant Table For V Component */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_V_SELECT_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_V_SELECT;

/** \brief  Q- table Selector 0 Quant Table For Y Component */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_Y_SELECT_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_Y_SELECT;

/** \brief  JPE Y Value Scaling Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_JPE_Y_SCALE_EN_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_JPE_Y_SCALE_EN;

/** \brief  Linear Downscaler Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_LDS_CTRL_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_LDS_CTRL;

/** \brief  Linear Downscaler Factor Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_LDS_FAC_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_LDS_FAC;

/** \brief  Memory Interface Counter Value of JPEG or RAW Data Bytes Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_BYTE_CNT_Bits B;             /**< \brief Bitfield access */
} Ifx_CIF_MI_BYTE_CNT;

/** \brief  Memory Interface Global Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_CTRL_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_MI_CTRL;

/** \brief  Memory Interface Global Control Internal Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_CTRL_SHD_Bits B;             /**< \brief Bitfield access */
} Ifx_CIF_MI_CTRL_SHD;

/** \brief  MI Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_ICR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_MI_ICR;

/** \brief  MI Interrupt Mask ‘1’ interrupt active ‘0’ interrupt masked */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_IMSC_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_MI_IMSC;

/** \brief  Memory Interface Control Register For Address Init And Skip Function
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_INIT_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_MI_INIT;

