lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  MI Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_ISR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_MI_ISR;

/** \brief  MI Masked Interrupt Status Registe */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MIS_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_MI_MIS;

/** \brief  Memory Interface Base Address For Main Picture Cb Component Ring
 * Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_BASE_AD_INIT;

/** \brief  Memory Interface Base Address Shadow Register For Main Picture Cb
 * Component Ring Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_BASE_AD_SHD;

/** \brief  Memory Interface Offset Counter Init Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits B;  /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT;

/** \brief  Memory Interface Current Offset Counter Of Main Picture Cb Component
 * Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD;

/** \brief  Memory Interface Offset Counter Start Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits B; /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_START;

/** \brief  Memory Interface Size Of Main Picture Cb Component Ring Buffer
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_SIZE_INIT;

/** \brief  Memory Interface Size Shadow Register Of Main Picture Cb Component
 * Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_SIZE_SHD;

/** \brief  Memory Interface Base Address For Main Picture Cr Component Ring
 * Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_BASE_AD_INIT;

/** \brief  Memory Interface Base Address Shadow Register For Main Picture Cr
 * Component Ring Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_BASE_AD_SHD;

/** \brief  Memory Interface Offset Counter Init value For Main Picture Cr
 * Component Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits B;  /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT;

/** \brief  Memory Interface Current Offset Counter Of Main Picture Cr Component
 * Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD;

/** \brief  Memory Interface Offset Counter Start Value For Main Picture Cr
 * Component Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits B; /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_START;

/** \brief  Memory Interface Size Of Main Picture Cr Component Ring Buffer
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_SIZE_INIT;

/** \brief  Memory Interface Size Shadow Register Of Main Picture Cr Component
 * Ring Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CR_SIZE_SHD;

/** \brief  Memory Interface Base Address For Main Picture Y Component, JPEG or
 * RAW Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_BASE_AD_INIT;

