lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  Memory Interface Base Address Shadow Register For Main Picture Y
 * Component, JPEG Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_BASE_AD_SHD;

/** \brief  Memory Interface Fill Level Interrupt Offset Value For Main Picture
 * Y, JPEG or RAW Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT;

/** \brief  Memory Interface Shadow Register of Fill Level Interrupt Offset
 * Value For Main Picture Y Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD;

/** \brief  Memory Interface Offset Counter Init Value For Main Picture Y, JPEG
 * or RAW Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT;

/** \brief  Memory Interface Current Offset Counter of Main Picture Y Component
 * JPEG or RAW Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD;

/** \brief  Memory Interface Offset Counter Start Value For Main Picture Y, JPEG
 * or RAW Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits B;  /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_START;

/** \brief  Memory Interface Size of main picture Y component, JPEG or RAW data
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_SIZE_INIT;

/** \brief  Memory Interface Size Shadow Register of Main Picture Y
 * Component,JPEG or RAW Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_Y_SIZE_SHD;

/** \brief  MI Raw Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_RIS_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_MI_RIS;

/** \brief  MI Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_STATUS_Bits B;               /**< \brief Bitfield access */
} Ifx_CIF_MI_STATUS;

/** \brief  MI Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MI_STATUS_CLR_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_MI_STATUS_CLR;

/** \brief  Memory Interface Base Address For Extra Path Data Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_BASE_AD_INIT;

/** \brief  Memory Interface Base Address Shadow Register for Extra Path Buffer
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_BASE_AD_SHD;

/** \brief  Memory Interface Extra Path Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_CTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_CTRL;

/** \brief  Memory Interface Extra Path Control Internal Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_CTRL_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_CTRL_SHD;

/** \brief  Memory Interface Extra Path Control Register For Address Init And
 * Skip Function Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_INIT_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_INIT;

/** \brief  Memory Interface Fill Level Interrupt Offset Value For Extra Path
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT;

