lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  Memory Interface Shadow Register of Fill Level Interrupt Offset
 * Value For Extra Path Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD;

/** \brief  Memory Interface Offset Counter Init Value For Extra Path Buffer
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits B;   /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_OFFS_CNT_INIT;

/** \brief  Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_OFFS_CNT_SHD;

/** \brief  Memory Interface Offset Counter Start Value For Extra Path Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits B;  /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_OFFS_CNT_START;

/** \brief  Memory Interface Size of Extra Path Data Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_SIZE_INIT_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_SIZE_INIT;

/** \brief  Memory Interface Size Shadow Register of Extra Path Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_SIZE_SHD_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_SIZE_SHD;

/** \brief  MI Extra Path Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_ICR_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_MIEP_ICR;

/** \brief  MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’: interrupt
 * masked */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_IMSC_Bits B;               /**< \brief Bitfield access */
} Ifx_CIF_MIEP_IMSC;

/** \brief  MI Extra Path Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_ISR_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_MIEP_ISR;

/** \brief  MI Extra Path Masked Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_MIS_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_MIEP_MIS;

/** \brief  MI Extra Path Raw Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_RIS_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_MIEP_RIS;

/** \brief  Extra Path Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_STA_ERR_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MIEP_STA_ERR;

/** \brief  Extra Path Error Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_MIEP_STA_ERR_CLR_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_MIEP_STA_ERR_CLR;

/** \brief  Watchdog Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_CTRL_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_WD_CTRL;

/** \brief  Watchdog Horizontal Timeout Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_H_TIMEOUT_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_WD_H_TIMEOUT;

/** \brief  Watchdog Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_ICR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_WD_ICR;

/** \brief  Watchdog Interrupt Mask Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_IMSC_Bits B;                 /**< \brief Bitfield access */
} Ifx_CIF_WD_IMSC;

/** \brief  Watchdog Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_ISR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_WD_ISR;

/** \brief  Watchdog Masked Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_MIS_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_WD_MIS;

/** \brief  Watchdog Raw Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_RIS_Bits B;                  /**< \brief Bitfield access */
} Ifx_CIF_WD_RIS;

/** \brief  Watchdog Vertical Timeout Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CIF_WD_V_TIMEOUT_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_WD_V_TIMEOUT;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \brief  Memory interface channel */
typedef volatile struct _Ifx_CIF_MIEP_CH
{
    Ifx_CIF_MIEP_CH_CTRL CTRL;              /**< \brief 0, Memory Interface Extra Path Control Register */
    Ifx_CIF_MIEP_CH_INIT INIT;              /**< \brief 4, Memory Interface Extra Path Control Register For Address Init And Skip Function Register */
    Ifx_CIF_MIEP_CH_BASE_AD_INIT BASE_AD_INIT;  /**< \brief 8, Memory Interface Base Address For Extra Path Data Buffer Register */
    Ifx_CIF_MIEP_CH_SIZE_INIT SIZE_INIT;    /**< \brief C, Memory Interface Size of Extra Path Data Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_INIT OFFS_CNT_INIT;    /**< \brief 10, Memory Interface Offset Counter Init Value For Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_START OFFS_CNT_START;  /**< \brief 14, Memory Interface Offset Counter Start Value For Extra Path Register */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT IRQ_OFFS_INIT;    /**< \brief 18, Memory Interface Fill Level Interrupt Offset Value For Extra Path Register */
    Ifx_CIF_MIEP_CH_CTRL_SHD CTRL_SHD;      /**< \brief 1C, Memory Interface Extra Path Control Internal Shadow Register */
    Ifx_CIF_MIEP_CH_BASE_AD_SHD BASE_AD_SHD;    /**< \brief 20, Memory Interface Base Address Shadow Register for Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_SIZE_SHD SIZE_SHD;      /**< \brief 24, Memory Interface Size Shadow Register of Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_SHD OFFS_CNT_SHD;  /**< \brief 28, Memory Interface Current Offset Counter of Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD IRQ_OFFS_SHD;  /**< \brief 2C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path Register */
    unsigned char reserved_30[208];         /**< \brief 30, \internal Reserved */
} Ifx_CIF_MIEP_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  BBB Object */
typedef volatile struct _Ifx_CIF_BBB
{
    Ifx_CIF_BBB_CLC CLC;                    /**< \brief 0, Clock Control Register */
    Ifx_CIF_BBB_MODID MODID;                /**< \brief 4, Module Identification Register */
    Ifx_CIF_BBB_GPCTL GPCTL;                /**< \brief 8, General Purpose Control Register */
    Ifx_CIF_BBB_ACCEN0 ACCEN0;              /**< \brief C, Access Enable Register 0 */
    Ifx_CIF_BBB_ACCEN1 ACCEN1;              /**< \brief 10, Access Enable Register 1 */
    Ifx_CIF_BBB_KRST0 KRST0;                /**< \brief 14, Kernel Reset Register 0 */
    Ifx_CIF_BBB_KRST1 KRST1;                /**< \brief 18, Kernel Reset Register 1 */
    Ifx_CIF_BBB_KRSTCLR KRSTCLR;            /**< \brief 1C, Kernel Reset Status Clear Register */
} Ifx_CIF_BBB;

/** \brief  DP Object */
typedef volatile struct _Ifx_CIF_DP
{
    Ifx_CIF_DP_CTRL CTRL;                   /**< \brief 0, Debug Path Control Register */
    Ifx_CIF_DP_PDIV_CTRL PDIV_CTRL;         /**< \brief 4, Debug Path Predivider Control Register */
    Ifx_CIF_DP_FLC_STAT FLC_STAT;           /**< \brief 8, Debug Path Frame/Line Counter Status Register */
    Ifx_CIF_DP_PDIV_STAT PDIV_STAT;         /**< \brief C, Debug Path Predivider Counter Status Register */
    Ifx_CIF_DP_TSC_STAT TSC_STAT;           /**< \brief 10, Debug Path Timestamp Counter Status Register */
    Ifx_CIF_DP_UDS UDS_1S[8];               /**< \brief 14, Debug Path User Defined Symbol Register \note Array index shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user manual UDS_1S1, ... */
} Ifx_CIF_DP;

/** \brief  EP Object */
typedef volatile struct _Ifx_CIF_EP_IC
{
    Ifx_CIF_EP_IC_CTRL CTRL;                /**< \brief 0, Extra Path Image Cropping Control Register */
    Ifx_CIF_EP_IC_RECENTER RECENTER;        /**< \brief 4, Extra Path Image Cropping Recenter Register */
    Ifx_CIF_EP_IC_H_OFFS H_OFFS;            /**< \brief 8, Extra Path Image Cropping Horizontal Offset of Output Window Register */
    Ifx_CIF_EP_IC_V_OFFS V_OFFS;            /**< \brief C, Extra Path Image Cropping Vertical Offset Of Output Window Register */
    Ifx_CIF_EP_IC_H_SIZE H_SIZE;            /**< \brief 10, Extra Path Image Cropping Output Horizontal Picture Size Register */
    Ifx_CIF_EP_IC_V_SIZE V_SIZE;            /**< \brief 14, Extra Path Image Cropping Output Vertical Picture Size Register */
    Ifx_CIF_EP_IC_MAX_DX MAX_DX;            /**< \brief 18, Extra Path Image Cropping Maximum Horizontal Displacement Register */
    Ifx_CIF_EP_IC_MAX_DY MAX_DY;            /**< \brief 1C, Extra Path Image Cropping Maximum Vertical Displacement Register */
    Ifx_CIF_EP_IC_DISPLACE DISPLACE;        /**< \brief 20, Extra Path Image Cropping Camera Displacement Register */
    Ifx_CIF_EP_IC_H_OFFS_SHD H_OFFS_SHD;    /**< \brief 24, Extra Path Image Current Horizontal Offset Of Output Window Shadow Register */
    Ifx_CIF_EP_IC_V_OFFS_SHD V_OFFS_SHD;    /**< \brief 28, Extra Path Image Current Vertical Offset Of Output Window Shadow Register */
    Ifx_CIF_EP_IC_H_SIZE_SHD H_SIZE_SHD;    /**< \brief 2C, Extra Path Image Current Output Horizontal Picture Size Shadow Register */
    Ifx_CIF_EP_IC_V_SIZE_SHD V_SIZE_SHD;    /**< \brief 30, Extra Path Image Current Output Vertical Picture Size Shadow Register */
    unsigned char reserved_34[204];         /**< \brief 34, \internal Reserved */
} Ifx_CIF_EP_IC;

/** \brief  ISP Object */
typedef volatile struct _Ifx_CIF_ISP
{
    Ifx_CIF_ISP_CTRL CTRL;                  /**< \brief 0, ISP Global Control Register */
    Ifx_CIF_ISP_ACQ_PROP ACQ_PROP;          /**< \brief 4, ISP Acquisition Properties Register */
    Ifx_CIF_ISP_ACQ_H_OFFS ACQ_H_OFFS;      /**< \brief 8, ISP Acquisition Horizontal Offset Register */
    Ifx_CIF_ISP_ACQ_V_OFFS ACQ_V_OFFS;      /**< \brief C, ISP Acquistion Vertical Offset Register */
    Ifx_CIF_ISP_ACQ_H_SIZE ACQ_H_SIZE;      /**< \brief 10, ISP Acquisition Horizontal Size Register */
    Ifx_CIF_ISP_ACQ_V_SIZE ACQ_V_SIZE;      /**< \brief 14, ISP Acquisition Vertical Size Register */
    Ifx_CIF_ISP_ACQ_NR_FRAMES ACQ_NR_FRAMES;    /**< \brief 18, ISP Acquisition Number of Frames Register */
    unsigned char reserved_1C[376];         /**< \brief 1C, \internal Reserved */
    Ifx_CIF_ISP_OUT_H_OFFS OUT_H_OFFS;      /**< \brief 194, ISP Output Window Horizontal Offset Register */
    Ifx_CIF_ISP_OUT_V_OFFS OUT_V_OFFS;      /**< \brief 198, ISP Output Window Vertical Offset Register */
    Ifx_CIF_ISP_OUT_H_SIZE OUT_H_SIZE;      /**< \brief 19C, ISP Output Horizontal Picture Size Register */
    Ifx_CIF_ISP_OUT_V_SIZE OUT_V_SIZE;      /**< \brief 1A0, ISP Output Vertical Picture Size Register */
    unsigned char reserved_1A4[4];          /**< \brief 1A4, \internal Reserved */
    Ifx_CIF_ISP_FLAGS_SHD FLAGS_SHD;        /**< \brief 1A8, ISP Shadow Flags Register */
    Ifx_CIF_ISP_OUT_H_OFFS_SHD OUT_H_OFFS_SHD;  /**< \brief 1AC, ISP Output Window Horizontal Offset Shadow Register */
    Ifx_CIF_ISP_OUT_V_OFFS_SHD OUT_V_OFFS_SHD;  /**< \brief 1B0, ISP Output Window Vertical Offset Shadow Register */
    Ifx_CIF_ISP_OUT_H_SIZE_SHD OUT_H_SIZE_SHD;  /**< \brief 1B4, ISP Output Horizontal Picture Size Shadow Register */
    Ifx_CIF_ISP_OUT_V_SIZE_SHD OUT_V_SIZE_SHD;  /**< \brief 1B8, ISP Output Vertical Picture Size Shadow Register */
    Ifx_CIF_ISP_IMSC IMSC;                  /**< \brief 1BC, ISP Interrupt Mask Register */
    Ifx_CIF_ISP_RIS RIS;                    /**< \brief 1C0, ISP Raw Interrupt Status Register */
    Ifx_CIF_ISP_MIS MIS;                    /**< \brief 1C4, ISP Masked Interrupt Status Register */
    Ifx_CIF_ISP_ICR ICR;                    /**< \brief 1C8, ISP Interrupt Clear Register */
    Ifx_CIF_ISP_ISR ISR;                    /**< \brief 1CC, ISP Interrupt Set Register */
    unsigned char reserved_1D0[108];        /**< \brief 1D0, \internal Reserved */
    Ifx_CIF_ISP_ERR ERR;                    /**< \brief 23C, ISP Error Register */
    Ifx_CIF_ISP_ERR_CLR ERR_CLR;            /**< \brief 240, ISP Error Clear Register */
    Ifx_CIF_ISP_FRAME_COUNT FRAME_COUNT;    /**< \brief 244, ISP Frame Counter Register */
} Ifx_CIF_ISP;

/** \brief  ISPIS Object */
typedef volatile struct _Ifx_CIF_ISPIS
{
    Ifx_CIF_ISPIS_CTRL CTRL;                /**< \brief 0, ISP Image Stabilization Control Register */
    Ifx_CIF_ISPIS_RECENTER RECENTER;        /**< \brief 4, ISP Image Stabilization Recenter Register */
    Ifx_CIF_ISPIS_H_OFFS H_OFFS;            /**< \brief 8, ISP Image Stabilization Horizontal Offset Of Output Window Register */
    Ifx_CIF_ISPIS_V_OFFS V_OFFS;            /**< \brief C, ISP Image Stabilization Vertical Offset Of Output Window Register */
    Ifx_CIF_ISPIS_H_SIZE H_SIZE;            /**< \brief 10, ISP Image Stabilization Output Horizontal Picture Size Register */
    Ifx_CIF_ISPIS_V_SIZE V_SIZE;            /**< \brief 14, ISP Image Stabilization Output Vertical Picture Size Register */
    Ifx_CIF_ISPIS_MAX_DX MAX_DX;            /**< \brief 18, ISP Image Stabilization Maximum Horizontal Displacement Register */
    Ifx_CIF_ISPIS_MAX_DY MAX_DY;            /**< \brief 1C, ISP Image Stabilization Maximum Vertical Displacement Register */
    Ifx_CIF_ISPIS_DISPLACE DISPLACE;        /**< \brief 20, ISP Image Stabilization Camera Displacement Register */
    Ifx_CIF_ISPIS_H_OFFS_SHD H_OFFS_SHD;    /**< \brief 24, SP Image Current Horizontal Offset Of Output Window Shadow Register */
    Ifx_CIF_ISPIS_V_OFFS_SHD V_OFFS_SHD;    /**< \brief 28, ISP Image Current Vertical Offset Of Output Window Shadow Register */
    Ifx_CIF_ISPIS_H_SIZE_SHD H_SIZE_SHD;    /**< \brief 2C, ISP Image Current Output Horizontal Picture Size Shadow Register */
    Ifx_CIF_ISPIS_V_SIZE_SHD V_SIZE_SHD;    /**< \brief 30, ISP Image Current Output Vertical Picture Size Shadow Register */
} Ifx_CIF_ISPIS;

/** \brief  JPE Object */
typedef volatile struct _Ifx_CIF_JPE
{
    Ifx_CIF_JPE_GEN_HEADER GEN_HEADER;      /**< \brief 0, JPE Command To Start Stream Header Generation Register */
    Ifx_CIF_JPE_ENCODE ENCODE;              /**< \brief 4, JPE Start Command To Start JFIF Stream Encoding Register */
    Ifx_CIF_JPE_INIT INIT;                  /**< \brief 8, JPE Automatic Configuration Update Register */
    Ifx_CIF_JPE_Y_SCALE_EN Y_SCALE_EN;      /**< \brief C, JPE Y Value Scaling Control Register */
    Ifx_CIF_JPE_CBCR_SCALE_EN CBCR_SCALE_EN;    /**< \brief 10, JPE Cb/Cr Value Scaling Control Register */
    Ifx_CIF_JPE_TABLE_FLUSH TABLE_FLUSH;    /**< \brief 14, JPE Header Generation Debug Register */
    Ifx_CIF_JPE_ENC_HSIZE ENC_HSIZE;        /**< \brief 18, JPEG Codec Horizontal Image Size For Encoding Register */
    Ifx_CIF_JPE_ENC_VSIZE ENC_VSIZE;        /**< \brief 1C, JPEG Codec Vertical Image Size For Encoding Register */
    Ifx_CIF_JPE_PIC_FORMAT PIC_FORMAT;      /**< \brief 20, JPEG Picture Encoding Format Register */
    Ifx_CIF_JPE_RESTART_INTERVAL RESTART_INTERVAL;  /**< \brief 24, JPE Restart Marker Insertion Register */
    Ifx_CIF_JPE_TQ_Y_SELECT TQ_Y_SELECT;    /**< \brief 28, Q- table Selector 0 Quant Table For Y Component */
    Ifx_CIF_JPE_TQ_U_SELECT TQ_U_SELECT;    /**< \brief 2C, Q- table Selector 1, Quant. Table For U Component */
    Ifx_CIF_JPE_TQ_V_SELECT TQ_V_SELECT;    /**< \brief 30, Q- table Selector 2 Quant Table For V Component */
    Ifx_CIF_JPE_DC_TABLE_SELECT DC_TABLE_SELECT;    /**< \brief 34, JPE Huffman Table Selector For DC Values Register */
    Ifx_CIF_JPE_AC_TABLE_SELECT AC_TABLE_SELECT;    /**< \brief 38, JPE Huffman Table Selector For AC Values Register */
    Ifx_CIF_JPE_TABLE_DATA TABLE_DATA;      /**< \brief 3C, JPE Table Programming Register */
    Ifx_CIF_JPE_TABLE_ID TABLE_ID;          /**< \brief 40, JPE Table Programming Select Register */
    Ifx_CIF_JPE_TAC0_LEN TAC0_LEN;          /**< \brief 44, JPE Huffman AC Table 0 Length Register */
    Ifx_CIF_JPE_TDC0_LEN TDC0_LEN;          /**< \brief 48, JPE Huffman DC Table 0 Length Register */
    Ifx_CIF_JPE_TAC1_LEN TAC1_LEN;          /**< \brief 4C, JPE Huffman AC Table 1 Length Register */
    Ifx_CIF_JPE_TDC1_LEN TDC1_LEN;          /**< \brief 50, JPE Huffman DC Table 1 Length Register */
    unsigned char reserved_54[4];           /**< \brief 54, \internal Reserved */
    Ifx_CIF_JPE_ENCODER_BUSY ENCODER_BUSY;  /**< \brief 58, JPE Encoder Status Flag Register */
    Ifx_CIF_JPE_HEADER_MODE HEADER_MODE;    /**< \brief 5C, JPE Header Mode Definition Register */
    Ifx_CIF_JPE_ENCODE_MODE ENCODE_MODE;    /**< \brief 60, JPE Encode Mode Register */
    Ifx_CIF_JPE_DEBUG DEBUG;                /**< \brief 64, JPE Debug Information Register */
    Ifx_CIF_JPE_ERROR_IMR ERROR_IMR;        /**< \brief 68, JPE Error Interrupt Mask Register */
    Ifx_CIF_JPE_ERROR_RIS ERROR_RIS;        /**< \brief 6C, JPE Error Raw Interrupt Status Register */
    Ifx_CIF_JPE_ERROR_MIS ERROR_MIS;        /**< \brief 70, JPE Error Masked Interrupt Status Register */
    Ifx_CIF_JPE_ERROR_ICR ERROR_ICR;        /**< \brief 74, JPE Error Interrupt Clear Register */
    Ifx_CIF_JPE_ERROR_ISR ERROR_ISR;        /**< \brief 78, JPE Error Interrupt Set Register */
    Ifx_CIF_JPE_STATUS_IMR STATUS_IMR;      /**< \brief 7C, JPEG Status Interrupt Mask Register */
    Ifx_CIF_JPE_STATUS_RIS STATUS_RIS;      /**< \brief 80, JPEG Status Raw Interrupt Status Register */
    Ifx_CIF_JPE_STATUS_MIS STATUS_MIS;      /**< \brief 84, JPEG Status Masked Interrupt Status Register */
    Ifx_CIF_JPE_STATUS_ICR STATUS_ICR;      /**< \brief 88, JPEG Status Interrupt Clear Register */
    Ifx_CIF_JPE_STATUS_ISR STATUS_ISR;      /**< \brief 8C, JPEG Status Interrupt Set Register */
} Ifx_CIF_JPE;

