lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_regdef.h
/** \brief  LDS Object */
typedef volatile struct _Ifx_CIF_LDS
{
    Ifx_CIF_LDS_CTRL CTRL;                  /**< \brief 0, Linear Downscaler Control Register */
    Ifx_CIF_LDS_FAC FAC;                    /**< \brief 4, Linear Downscaler Factor Register */
} Ifx_CIF_LDS;

/** \brief  MI Object */
typedef volatile struct _Ifx_CIF_MI
{
    Ifx_CIF_MI_CTRL CTRL;                   /**< \brief 0, Memory Interface Global Control Register */
    Ifx_CIF_MI_INIT INIT;                   /**< \brief 4, Memory Interface Control Register For Address Init And Skip Function Register */
    Ifx_CIF_MI_MP_Y_BASE_AD_INIT MP_Y_BASE_AD_INIT; /**< \brief 8, Memory Interface Base Address For Main Picture Y Component, JPEG or RAW Data Register */
    Ifx_CIF_MI_MP_Y_SIZE_INIT MP_Y_SIZE_INIT;   /**< \brief C, Memory Interface Size of main picture Y component, JPEG or RAW data Register */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT MP_Y_OFFS_CNT_INIT;   /**< \brief 10, Memory Interface Offset Counter Init Value For Main Picture Y, JPEG or RAW Data Register */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_START MP_Y_OFFS_CNT_START; /**< \brief 14, Memory Interface Offset Counter Start Value For Main Picture Y, JPEG or RAW Data Register */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT MP_Y_IRQ_OFFS_INIT;   /**< \brief 18, Memory Interface Fill Level Interrupt Offset Value For Main Picture Y, JPEG or RAW Data Register */
    Ifx_CIF_MI_MP_CB_BASE_AD_INIT MP_CB_BASE_AD_INIT;   /**< \brief 1C, Memory Interface Base Address For Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CB_SIZE_INIT MP_CB_SIZE_INIT; /**< \brief 20, Memory Interface Size Of Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT MP_CB_OFFS_CNT_INIT; /**< \brief 24, Memory Interface Offset Counter Init Value For Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_START MP_CB_OFFS_CNT_START;   /**< \brief 28, Memory Interface Offset Counter Start Value For Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_BASE_AD_INIT MP_CR_BASE_AD_INIT;   /**< \brief 2C, Memory Interface Base Address For Main Picture Cr Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_SIZE_INIT MP_CR_SIZE_INIT; /**< \brief 30, Memory Interface Size Of Main Picture Cr Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT MP_CR_OFFS_CNT_INIT; /**< \brief 34, Memory Interface Offset Counter Init value For Main Picture Cr Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_START MP_CR_OFFS_CNT_START;   /**< \brief 38, Memory Interface Offset Counter Start Value For Main Picture Cr Component Ring Buffer Register */
    unsigned char reserved_3C[52];          /**< \brief 3C, \internal Reserved */
    Ifx_CIF_MI_BYTE_CNT BYTE_CNT;           /**< \brief 70, Memory Interface Counter Value of JPEG or RAW Data Bytes Register */
    Ifx_CIF_MI_CTRL_SHD CTRL_SHD;           /**< \brief 74, Memory Interface Global Control Internal Shadow Register */
    Ifx_CIF_MI_MP_Y_BASE_AD_SHD MP_Y_BASE_AD_SHD;   /**< \brief 78, Memory Interface Base Address Shadow Register For Main Picture Y Component, JPEG Register */
    Ifx_CIF_MI_MP_Y_SIZE_SHD MP_Y_SIZE_SHD; /**< \brief 7C, Memory Interface Size Shadow Register of Main Picture Y Component,JPEG or RAW Data Register */
    Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD MP_Y_OFFS_CNT_SHD; /**< \brief 80, Memory Interface Current Offset Counter of Main Picture Y Component JPEG or RAW Register */
    Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD MP_Y_IRQ_OFFS_SHD; /**< \brief 84, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register */
    Ifx_CIF_MI_MP_CB_BASE_AD_SHD MP_CB_BASE_AD_SHD; /**< \brief 88, Memory Interface Base Address Shadow Register For Main Picture Cb Component Ring Register */
    Ifx_CIF_MI_MP_CB_SIZE_SHD MP_CB_SIZE_SHD;   /**< \brief 8C, Memory Interface Size Shadow Register Of Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD MP_CB_OFFS_CNT_SHD;   /**< \brief 90, Memory Interface Current Offset Counter Of Main Picture Cb Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_BASE_AD_SHD MP_CR_BASE_AD_SHD; /**< \brief 94, Memory Interface Base Address Shadow Register For Main Picture Cr Component Ring Register */
    Ifx_CIF_MI_MP_CR_SIZE_SHD MP_CR_SIZE_SHD;   /**< \brief 98, Memory Interface Size Shadow Register Of Main Picture Cr Component Ring Buffer Register */
    Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD MP_CR_OFFS_CNT_SHD;   /**< \brief 9C, Memory Interface Current Offset Counter Of Main Picture Cr Component Ring Buffer Register */
    unsigned char reserved_A0[88];          /**< \brief A0, \internal Reserved */
    Ifx_CIF_MI_IMSC IMSC;                   /**< \brief F8, MI Interrupt Mask ‘1’ interrupt active ‘0’ interrupt masked */
    Ifx_CIF_MI_RIS RIS;                     /**< \brief FC, MI Raw Interrupt Status Register */
    Ifx_CIF_MI_MIS MIS;                     /**< \brief 100, MI Masked Interrupt Status Registe */
    Ifx_CIF_MI_ICR ICR;                     /**< \brief 104, MI Interrupt Clear Register */
    Ifx_CIF_MI_ISR ISR;                     /**< \brief 108, MI Interrupt Set Register */
    Ifx_CIF_MI_STATUS STATUS;               /**< \brief 10C, MI Status Register */
    Ifx_CIF_MI_STATUS_CLR STATUS_CLR;       /**< \brief 110, MI Status Clear Register */
} Ifx_CIF_MI;

/** \brief  MIEP Object */
typedef volatile struct _Ifx_CIF_MIEP
{
    Ifx_CIF_MIEP_STA_ERR STA_ERR;           /**< \brief 0, Extra Path Error Register */
    Ifx_CIF_MIEP_STA_ERR_CLR STA_ERR_CLR;   /**< \brief 4, Extra Path Error Clear Register */
    Ifx_CIF_MIEP_IMSC IMSC;                 /**< \brief 8, MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’: interrupt masked */
    Ifx_CIF_MIEP_RIS RIS;                   /**< \brief C, MI Extra Path Raw Interrupt Status Register */
    Ifx_CIF_MIEP_MIS MIS;                   /**< \brief 10, MI Extra Path Masked Interrupt Status Register */
    Ifx_CIF_MIEP_ICR ICR;                   /**< \brief 14, MI Extra Path Interrupt Clear Register */
    Ifx_CIF_MIEP_ISR ISR;                   /**< \brief 18, MI Extra Path Interrupt Set Register */
    unsigned char reserved_1C[228];         /**< \brief 1C, \internal Reserved */
    Ifx_CIF_MIEP_CH CH_1S[5];               /**< \brief 100, Memory interface channel \note Array index shifted by 1. Example: defined register CH_1S[0]/CH_1S0 corresponds to user manual CH_1S1, ... */
} Ifx_CIF_MIEP;

